Revit 2027 API
NumericRevisionSettings Methods
The NumericRevisionSettings type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Determines whether a specified NumericRevisionSettings is the same as 'this'.
IsValid |  Determines whether the NumericRevisionSettings object is in a valid state.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace